# PhyMaterialParamShearStrengthReduction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamShearStrengthReduction Property
ParameterTypeId Class See Also
---
"Shear strength modification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamShearStrengthReduction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamShearStrengthReduction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamShearStrengthReduction {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace